ESP-Lab-Inventory-Manager/app/controllers/items_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @item = Item.find(id) # look up movie by unique ID
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @item = Item.create!(item_params)
---
INSERT INTO "items" ("category", "name", "quantity", "condition", "available", "description", "purchase_link") VALUES (?, ?, ?, ?, ?, ?, ?)  [["category", "Microscopes\t"], ["name", "sdfb"], ["quantity", 4], ["condition", 1], ["available", 1], ["description", "kfkjsdfjjsdf"], ["purchase_link", "jfsdfghgjdhgf.com"]]